{
  "quickStart": "# Quick Start\n\nWelcome to Behaviors! Here's a guide to get you started.\n\n## Step 1: Create Your First Behavior\n\n1. Place a token on your map\n2. Right-click the token and select \"Edit Behaviors\"\n3. Find the 'immediately' hat block that's pre-populated in your script\n4. Add a \"say\" block from the Looks category and connect it below the hat block\n5. Type a message like \"Hello World!\" in the say block\n\n![Creating your first behavior](/docs/assets/creating-first-behavior.gif)\n\n## Step 2: Test It Out\n\nSave the script and and watch your token say your message!\n\n![Testing the behavior](/docs/assets/testing-behavior.gif)\n\n## Step 3: Try Something More Advanced\n\n1. Edit the same token's behaviors again\n2. Add a \"move forward\" block after the \"say\" block\n3. Set the distance to 2 grid cells\n4. Save and test - now your token will speak and move!\n\n## What's Next?\n\n-   Explore the different block categories in the toolbox\n-   Try some of the scripts from the 'Ideas' tab\n-   Try using tags to create specialized behaviors\n-   Use broadcasts to make tokens communicate with each other\n-   Add sound effects to make behaviors more engaging\n\nYou're ready to bring your tokens to life!\n",
  "howToUse": "# How to Use\n\n## Getting Started\n\n![Creating your first behavior](/docs/assets/creating-first-behavior.gif)\n\n1. **Right-click any token** on your Owlbear Rodeo map to open the context menu\n2. **Select \"Edit Behaviors\"** to open the visual block editor\n3. **Drag blocks** from the toolbox to create your token's behavior\n4. **Connect blocks** together to build complex behaviors\n5. **Save your work** and watch your token come to life!\n\n![Testing the behavior](/docs/assets/testing-behavior.gif)\n\n## Basic Concepts\n\n### Blocks\n\nScripts in Behaviors are built by dragging blocks together.\n\nHere are the different kinds of blocks:\n\n-   **Hat blocks**: Trigger when something happens (like \"when selected\" or \"when message received\"). When the trigger occurrs, the blocks stacked underneath the hat block will run.\n    -   Example: ![Hat block example](/docs/assets/hat-block-example.svg)\n-   **Stack blocks**: These blocks make your token do something (such as move, change appearance, or play sound). They can be stacked on top of each other, and run from top to bottom.\n    -   Example: ![Stack block example](/docs/assets/stack-block-example.svg)\n-   **Cap blocks**: These blocks are like stack blocks, but never move on to the next block.\n    -   Example: ![Cap block example](/docs/assets/cap-block-example.svg)\n-   **C blocks**: Some blocks are C-shaped, and contain spaces to put other blocks inside them, such as conditionals and loops.\n    -   Example: ![C block example](/docs/assets/c-block-example.svg)\n-   **Reporter blocks**: These rounded blocks output a value, and can be plugged into other blocks to alter their behavior.\n    -   Example: ![Reporter block example](/docs/assets/reporter-block-example.svg)\n-   **Boolean blocks**: Like reporter blocks, these hexagonal blocks output a value, but the value is either `true` or `false`. They can be used in control flow to check conditions.\n    -   Example: ![Boolean block example](/docs/assets/boolean-block-example.svg)\n\n### Tags\n\nTokens can be labelled with tags, which are bits of text attached to a token.\n\n-   **Add tags** to tokens to group them or create specialized behaviors\n-   Drag blocks onto the tag field in tag blocks to dynamically choose or construct tags at runtime\n-   Edit tags from the right-click behaviors menu for an item\n-   All tags in the scene are visible in the main Behaviors panel for easy management\n\n### Messages\n\n-   **Send messages** between tokens using broadcast blocks\n-   Broadcast messages from the main Behaviors panel as well as from behavior scripts\n-   Drag blocks onto the message field in message blocks to dynamically choose or construct tags at runtime\n\n![Sending a Message](/docs/assets/sending-message.gif)\n\n### Sounds\n\n-   **Add sound effects** through the sound management panel in the action window\n-   See [FreeSound](https://freesound.org/) for a royalty-free sound effects library, or [Kevin MacLeod](https://incompetech.com/music/royalty-free/music.html) for royalty-free music.\n-   Sounds are loaded from URLs. You can upload sounds to a hosting service like Dropbox to get a persistent URL for them.\n\n## Notes on Features\n\n### Variables\n\n-   Create variables to store and manipulate data\n-   Variables accept any type of value, and can be used in place of any type of data\n-   Variables reset when the page is reloaded or when you save a behavior script\n\n### Motion\n\n-   Move tokens smoothly with glide blocks\n-   Note that when players switch back to Owlbear Rodeo after being in another tab, all updates that occurred since their last visit will play forward, so your animations may appear jerky.\n-   In the 'go' block, the '⏩' option means to move the token in the direction it's facing. In Owlbear Rodeo, 0 degrees rotation means a token is facing up. A token will face in the direction of its rotation handle.\n\n### Selection Control\n\n-   'When I am selected' blocks fire no matter who selects the token\n-   'Deselect' blocks apply to all players\n\n### Cloning\n\n-   The clone block produces an effect the same as if you duplicated the object in Owlbear Rodeo - editing the original will not edit the clone, and variables for the clone will be reset to their undefined state.\n\n### Other Extensions and Integrations\n\n-   Behaviors can integrate with other extensions. Blocks for controlling other extensions are in the 'extensions' section of the block toolbox. You must have the other extension installed in order for Behaviors to integrate with it.\n-   The Google Sheets integration pulls the current value of a cell, not the text of the formula that produced it.\n\n## Tips\n\n### Best Practices\n\n-   **Start simple**: Begin with basic \"when message received\" behaviors before building complex interactions\n-   **Test frequently**: Save and test your behaviors often to catch issues early\n-   **Use comments**: Add comment blocks to document complex behaviors\n-   **Organize blocks**: Keep related blocks close together for easier reading\n-   **Don't overwhelm Owlbear Rodeo**: Running many behaviors at once (especially animations) may cause the VTT to glitch out or drop updates.\n\n### Sharing Behaviors\n\nTo share behavior scripts between tokens, you have a few options:\n\n-   **Duplicate a token**. The easy option. When you duplicate a token, its behaviors are copied.\n-   **Prefabs**. To share tokens with behaviors between scenes, save the token as a prefab with the Prefabs extension. When you insert the prefab, the behaviors come with it.\n-   **Backpack**. You can drag scripts to the backpack icon in the top right of your block workspace to put them in your backpack, and click the backpack to open it while editing any token. Block stacks saved to your backpack are saved to your browser's local storage, so they'll persist across scenes and even rooms.\n\n![Using the Backpack](/docs/assets/backpack.gif)\n",
  "ideas": "# Ideas\n\nHere are some example behavior scripts to inspire you.\n\n## Zombie Chase\n\n![Zombie chase script](/docs/assets/zombie-script.svg)\n\nApply this script to several zombie tokens to have them chase the closest player when you send a message.\n\n![Zombie chase demo](/docs/assets/zombie-chase.gif)\n\n## Button\n\n![Button script](/docs/assets/button-script.svg)\n\nThis script makes a token or shape act as a button - locked in place, and when you double click it, it sends a message.\n\n![Button demo](/docs/assets/button.gif)\n\n(How do you edit the button again now that selecting it fires a behavior? Use the 'edit directly' tool from the Behaviors action panel to modify its behaviors without selecting it)\n"
}